{"format": "graph-model", "generatedBy": "2.7.0-dev20210923", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"outputs": {"SemanticPredictions": {"name": "SemanticPredictions"}}}, "modelTopology": {"node": [{"name": "ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/depthwise/SpaceToBatchND/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/depthwise/SpaceToBatchND/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "640"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/depthwise/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/depthwise/BatchToSpaceND/crops", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/depthwise/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/depthwise/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "640"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/depthwise/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/depthwise/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/depthwise/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/depthwise/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "640"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/depthwise/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/depthwise/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "mul_2/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "pad_to_bounding_box_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box_1/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box_1/stack_2/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box/stack_1/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sub/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Maximum/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "pad_to_bounding_box/stack_2/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sub_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Maximum_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "pad_to_bounding_box/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box/stack_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "resize/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Cast_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "pad_to_bounding_box_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box_1/stack_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sub_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/depthwise/SpaceToBatchND/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/depthwise/SpaceToBatchND/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/depthwise/BatchToSpaceND/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/depthwise/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "logits/semantic/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "19"}]}}}}}, {"name": "logits/semantic/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "19"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ResizeBilinear_1/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "strided_slice_4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_7/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "strided_slice_7/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_5/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_5/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_3/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_6/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_6/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_6/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_7/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ImageTensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_UINT8"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/BatchNorm/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_1/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_1/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_1/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_1/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_2/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_2/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_2/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "192"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_2/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_3/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_3/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_3/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_3/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_4/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}}}, {"name": "MobilenetEdgeTPU/Conv_1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "1280"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_4/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_4/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/Conv_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_4/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_5/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/depthwise/BatchNorm/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_5/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_5/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_5/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_6/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "192"}]}}}}}, {"name": "aspp0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_6/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_6/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "48"}]}}}}}, {"name": "aspp0/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_6/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_7/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "192"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_7/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_7/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "48"}]}}}}}, {"name": "image_pooling/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_7/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_8/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_8/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "image_pooling/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_8/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "48"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/BatchNorm/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_8/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_9/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_9/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_9/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_9/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_9/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_9/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_10/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}}}, {"name": "concat_projection/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_10/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_10/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_10/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_10/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "concat_projection/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_10/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_11/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_11/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_11/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_11/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_11/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/depthwise/BatchNorm/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_11/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_12/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_12/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_12/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_12/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_12/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_12/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_13/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_13/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_13/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "768"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_13/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_13/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_13/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_14/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_14/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_14/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_14/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_14/project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_14/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_15/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_15/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_15/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_15/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_15/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_15/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_16/expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_16/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_16/depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_16/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetEdgeTPU/expanded_conv_16/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/BatchNorm/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_16/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_17/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "768"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_17/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_17/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "768"}, {"size": "1"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_17/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_17/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/depthwise/BatchNorm/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_17/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_18/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/BatchNorm/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_19/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/depthwise/BatchNorm/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "640"}, {"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_20/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "MobilenetEdgeTPU/expanded_conv_21/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "1280"}]}}}}}, {"name": "Squeeze", "op": "Squeeze", "input": ["ImageTensor"], "attr": {"T": {"type": "DT_UINT8"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "Shape", "op": "Shape", "input": ["ImageTensor"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_UINT8"}}}, {"name": "Cast", "op": "Cast", "input": ["Squeeze"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_UINT8"}, "Truncate": {"b": false}}}, {"name": "Shape_2", "op": "Shape", "input": ["Squeeze"], "attr": {"T": {"type": "DT_UINT8"}, "out_type": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box/sub", "op": "Sub", "input": ["Cast", "Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape_1", "op": "Shape", "input": ["Cast"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_3", "op": "StridedSlice", "input": ["Shape_2", "strided_slice_3/stack", "strided_slice_3/stack_1", "strided_slice_3/stack_2"], "attr": {"end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "pad_to_bounding_box/ExpandDims", "op": "ExpandDims", "input": ["pad_to_bounding_box/sub", "pad_to_bounding_box/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_2/stack", "strided_slice_2/stack_1", "strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "strided_slice_5", "op": "StridedSlice", "input": ["strided_slice_3", "strided_slice_5/stack", "strided_slice_5/stack_1", "strided_slice_5/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "strided_slice_6", "op": "StridedSlice", "input": ["strided_slice_3", "strided_slice_6/stack", "strided_slice_6/stack_1", "strided_slice_6/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "pad_to_bounding_box/Shape", "op": "Shape", "input": ["pad_to_bounding_box/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["sub/x", "strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Cast_5", "op": "Cast", "input": ["strided_slice_1"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "Cast_2", "op": "Cast", "input": ["strided_slice_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "sub_1", "op": "Sub", "input": ["sub_1/x", "strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Cast_6", "op": "Cast", "input": ["strided_slice_2"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "Cast_4", "op": "Cast", "input": ["strided_slice_2"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_7/stack_1", "op": "Pack", "input": ["strided_slice_7/stack_1/0", "strided_slice_5", "strided_slice_6"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "pad_to_bounding_box/unstack", "op": "Unpack", "input": ["pad_to_bounding_box/Shape"], "attr": {"num": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "Maximum", "op": "Maximum", "input": ["sub", "Maximum/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "truediv", "op": "RealDiv", "input": ["Cast_1", "Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Maximum_1", "op": "Maximum", "input": ["sub_1", "Maximum_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["Cast_3", "Cast_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["strided_slice_1", "Maximum"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "add_1", "op": "AddV2", "input": ["strided_slice_2", "Maximum_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Minimum", "op": "Minimum", "input": ["truediv", "truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pad_to_bounding_box/sub_4", "op": "Sub", "input": ["add", "pad_to_bounding_box/unstack:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "pad_to_bounding_box/sub_2", "op": "Sub", "input": ["add_1", "pad_to_bounding_box/unstack:2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "mul", "op": "Mul", "input": ["Cast_5", "Minimum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["Cast_6", "Minimum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pad_to_bounding_box/stack_1", "op": "Pack", "input": ["pad_to_bounding_box/stack_1/0", "pad_to_bounding_box/sub_4"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "pad_to_bounding_box/stack_2", "op": "Pack", "input": ["pad_to_bounding_box/stack_2/0", "pad_to_bounding_box/sub_2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "resize/Cast", "op": "Cast", "input": ["mul"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "resize/Cast_1", "op": "Cast", "input": ["mul_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "pad_to_bounding_box/stack_4", "op": "Pack", "input": ["pad_to_bounding_box/stack", "pad_to_bounding_box/stack_1", "pad_to_bounding_box/stack_2", "pad_to_bounding_box/stack_3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "resize/size", "op": "Pack", "input": ["resize/Cast", "resize/Cast_1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "pad_to_bounding_box/Pad", "op": "Pad", "input": ["pad_to_bounding_box/ExpandDims", "pad_to_bounding_box/stack_4"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "pad_to_bounding_box/Squeeze", "op": "Squeeze", "input": ["pad_to_bounding_box/Pad"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "pad_to_bounding_box/add", "op": "AddV2", "input": ["pad_to_bounding_box/Squeeze", "Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "resize/ExpandDims", "op": "ExpandDims", "input": ["pad_to_bounding_box/add", "resize/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": 